# GetGreen Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..GetGreen Method
ColorWithTransparency Class See Also
---
get green
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public uint GetGreen()
```

Visual Basic
---
```text
Public Function GetGreen As UInteger
```

Visual C++
---
```text
public:
unsigned int GetGreen()
```

# ### Return Value
green
# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace